benchmarkResults/baseline_http.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmark.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 55s max duration (incl. graceful stop):
              * baseline_http: Up to 50 looping VUs for 25s over 3 stages (gracefulRampDown: 30s, exec: baselineHttp, gracefulStop: 30s)


running (01.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
baseline_http   [   4% ] 01/50 VUs  01.0s/25.0s

running (02.0s), 03/50 VUs, 3 complete and 0 interrupted iterations
baseline_http   [   8% ] 03/50 VUs  02.0s/25.0s

running (03.0s), 05/50 VUs, 10 complete and 0 interrupted iterations
baseline_http   [  12% ] 05/50 VUs  03.0s/25.0s

running (04.0s), 07/50 VUs, 21 complete and 0 interrupted iterations
baseline_http   [  16% ] 07/50 VUs  04.0s/25.0s

running (05.0s), 09/50 VUs, 36 complete and 0 interrupted iterations
baseline_http   [  20% ] 09/50 VUs  05.0s/25.0s

running (06.0s), 11/50 VUs, 55 complete and 0 interrupted iterations
baseline_http   [  24% ] 11/50 VUs  06.0s/25.0s

running (07.0s), 13/50 VUs, 78 complete and 0 interrupted iterations
baseline_http   [  28% ] 13/50 VUs  07.0s/25.0s

running (08.0s), 15/50 VUs, 105 complete and 0 interrupted iterations
baseline_http   [  32% ] 15/50 VUs  08.0s/25.0s

running (09.0s), 17/50 VUs, 136 complete and 0 interrupted iterations
baseline_http   [  36% ] 17/50 VUs  09.0s/25.0s

running (10.0s), 19/50 VUs, 171 complete and 0 interrupted iterations
baseline_http   [  40% ] 19/50 VUs  10.0s/25.0s

running (11.0s), 21/50 VUs, 210 complete and 0 interrupted iterations
baseline_http   [  44% ] 21/50 VUs  11.0s/25.0s

running (12.0s), 23/50 VUs, 253 complete and 0 interrupted iterations
baseline_http   [  48% ] 23/50 VUs  12.0s/25.0s

running (13.0s), 25/50 VUs, 300 complete and 0 interrupted iterations
baseline_http   [  52% ] 25/50 VUs  13.0s/25.0s

running (14.0s), 27/50 VUs, 351 complete and 0 interrupted iterations
baseline_http   [  56% ] 27/50 VUs  14.0s/25.0s

running (15.0s), 29/50 VUs, 406 complete and 0 interrupted iterations
baseline_http   [  60% ] 29/50 VUs  15.0s/25.0s

running (16.0s), 31/50 VUs, 465 complete and 0 interrupted iterations
baseline_http   [  64% ] 31/50 VUs  16.0s/25.0s

running (17.0s), 33/50 VUs, 528 complete and 0 interrupted iterations
baseline_http   [  68% ] 33/50 VUs  17.0s/25.0s

running (18.0s), 35/50 VUs, 595 complete and 0 interrupted iterations
baseline_http   [  72% ] 35/50 VUs  18.0s/25.0s

running (19.0s), 37/50 VUs, 666 complete and 0 interrupted iterations
baseline_http   [  76% ] 37/50 VUs  19.0s/25.0s

running (20.0s), 39/50 VUs, 741 complete and 0 interrupted iterations
baseline_http   [  80% ] 39/50 VUs  20.0s/25.0s

running (21.0s), 41/50 VUs, 820 complete and 0 interrupted iterations
baseline_http   [  84% ] 41/50 VUs  21.0s/25.0s

running (22.0s), 43/50 VUs, 903 complete and 0 interrupted iterations
baseline_http   [  88% ] 43/50 VUs  22.0s/25.0s

running (23.0s), 45/50 VUs, 990 complete and 0 interrupted iterations
baseline_http   [  92% ] 45/50 VUs  23.0s/25.0s

running (24.0s), 47/50 VUs, 1080 complete and 0 interrupted iterations
baseline_http   [  96% ] 47/50 VUs  24.0s/25.0s

running (25.0s), 49/50 VUs, 1175 complete and 0 interrupted iterations
baseline_http   [ 100% ] 49/50 VUs  25.0s/25.0s
     ✓ [baseline_http] status 200

     checks.........................: 100.00% ✓ 1224      ✗ 0   
     data_received..................: 802 kB  32 kB/s
     data_sent......................: 108 kB  4.3 kB/s
     http_req_blocked...............: avg=39.75µs  min=0s       med=3µs      max=4.26ms   p(90)=9µs      p(95)=26.54µs 
     http_req_connecting............: avg=25.6µs   min=0s       med=0s       max=4.2ms    p(90)=0s       p(95)=0s      
   ✗ http_req_duration..............: avg=506.77ms min=500.26ms med=506.19ms max=702.44ms p(90)=512.01ms p(95)=513.81ms
       { expected_response:true }...: avg=506.77ms min=500.26ms med=506.19ms max=702.44ms p(90)=512.01ms p(95)=513.81ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 1224
     http_req_receiving.............: avg=59.99µs  min=7µs      med=37µs     max=2.25ms   p(90)=107.7µs  p(95)=144.84µs
     http_req_sending...............: avg=23.62µs  min=2µs      med=9µs      max=3.5ms    p(90)=29µs     p(95)=55µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=506.69ms min=500.22ms med=506.11ms max=701.68ms p(90)=511.96ms p(95)=513.72ms
     http_reqs......................: 1224    48.356566/s
     iteration_duration.............: avg=506.97ms min=500.37ms med=506.41ms max=707.83ms p(90)=512.29ms p(95)=513.95ms
     iterations.....................: 1224    48.356566/s
     vus............................: 49      min=1       max=49
     vus_max........................: 50      min=50      max=50
running (25.3s), 00/50 VUs, 1224 complete and 0 interrupted iterations
baseline_http ✓ [ 100% ] 00/50 VUs  25s